In [3]:
import pandas as pd
import numpy as np

In [4]:
df = pd.read_table("ftp://aftp.cmdl.noaa.gov/products/trends/co2/co2_mm_mlo.txt", delim_whitespace=True, comment='#' , header=None)

/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead, passing sep='\t'.
  """Entry point for launching an IPython kernel.

In [7]:
df.head()

      0  1         2       3       4       5  6
0  1958  3  1958.208  315.71  315.71  314.62 -1
1  1958  4  1958.292  317.45  317.45  315.29 -1
2  1958  5  1958.375  317.50  317.50  314.71 -1
3  1958  6  1958.458  -99.99  317.10  314.85 -1
4  1958  7  1958.542  315.86  315.86  314.98 -1

In [15]:
newdf = df.loc[:,[0,1,3]]

In [17]:
new_names = ['year', 'month', 'co2']

In [18]:
newdf.columns = new_names

In [19]:
newdf.head()

   year  month     co2
0  1958      3  315.71
1  1958      4  317.45
2  1958      5  317.50
3  1958      6  -99.99
4  1958      7  315.86

In [31]:
newdf.drop('Day', axis =1, inplace=True)
newdf.head()

   year  month     co2  day
0  1958      3  315.71   15
1  1958      4  317.45   15
2  1958      5  317.50   15
3  1958      6  -99.99   15
4  1958      7  315.86   15

In [32]:
newdf.head()

   year  month     co2  day
0  1958      3  315.71   15
1  1958      4  317.45   15
2  1958      5  317.50   15
3  1958      6  -99.99   15
4  1958      7  315.86   15

In [ ]:
#newdf['date'] = map(lambda day,month, year: '%d/%m/%Y')

In [ ]:
newnames = '%d%/m/%Y'
newdf[['day','month','year']] = ['']